app/views/bollywoods/index.html.erb

SELECT COUNT(*) FROM `bollywoods`
SELECT `bollywoods`.* FROM `bollywoods`
---
<% if @lboard.curb > 0 %>
	<% if @lboard.curb != Bollywood.count() %>

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
		<tr>
			<td style="text-align: center;"><%= User.find(bol.user_id).email %></td>