app/views/bollywoods/show.html.erb

<h3>Your Score is : <b><%= @lbd.Bscore %></b></h3>
  <% if Bollywood.count()==@bollywood.id %>
---
SELECT COUNT(*) FROM `bollywoods`