app/views/hollywoods/index.html.erb

<% if @lboard.curh > 0 %>
	<% if @lboard.curh != Hollywood.count() %>
---
SELECT COUNT(*) FROM `hollywoods`

		<tr>
			<td style="text-align: center;"><%= User.find(bol.user_id).email %></td>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1