app/views/hollywoods/show.html.erb

<h3>Your Score is : <b><%= @lbd.Hscore %></b></h3>
  <% if Hollywood.count()==@hollywood.id %>
---
SELECT COUNT(*) FROM `hollywoods`