app/views/crickets/index.html.erb

SELECT COUNT(*) FROM `crickets`
SELECT `crickets`.* FROM `crickets`
---
<% if @lboard.curc > 0 %>
	<% if @lboard.curc != Cricket.count %>

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
		<tr>
			<td style="text-align: center;"><%= User.find(bol.user_id).email %></td>