app/views/crickets/show.html.erb

<h3>Your Score is : <b><%= @lbd.Cscore %></b></h3>
  <% if Cricket.count()==@cricket.id %>
---
SELECT COUNT(*) FROM `crickets`