app/views/footballs/index.html.erb

<% if @lboard.curf > 0 %>
	<% if @lboard.curf != Football.count() %>
---
SELECT COUNT(*) FROM `footballs`

		<tr>
			<td style="text-align: center;"><%= User.find(bol.user_id).email %></td>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1