app/views/footballs/show.html.erb

<h3>Your Score is : <b><%= @lbd.Fscore %></b></h3>
  <% if Football.count()==@football.id %>
---
SELECT COUNT(*) FROM `footballs`