app/views/home/index.html.erb

          <a href="/crickets"><li class="list-group-item list-group-item-success">Cricket
            <% if Leaderboard.find_by_user_id(current_user.id).crikcheck == true %>
---
SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 1 LIMIT 1