app/controllers/bollywoods_controller.rb

SELECT `bollywoods`.* FROM `bollywoods`
SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 1 LIMIT 1
SELECT `leaderboards`.* FROM `leaderboards` ORDER BY maxb DESC
SELECT COUNT(*) FROM `bollywoods`
SELECT COUNT(*) FROM `leaderboards`
UPDATE `leaderboards` SET `curb` = 0, `Bscore` = 0, `updated_at` = '2017-09-17 13:45:11' WHERE `leaderboards`.`id` = 1
---
  def index
    if current_user
      @bollywoods = Bollywood.all
      @lbd=Leaderboard.find_by_user_id(current_user.id)
      @lboard=Leaderboard.find_by_user_id(current_user.id)
      @bol=Leaderboard.order('maxb DESC')
      if @lbd.curb==Bollywood.count()
        @lbd.Bscore=0
        @lbd.curb=0
        @lbd.save

SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 1 LIMIT 1
UPDATE `leaderboards` SET `curb` = 1, `bollycheck` = 1, `updated_at` = '2017-09-19 22:54:52' WHERE `leaderboards`.`id` = 1
SELECT COUNT(*) FROM `bollywoods`
---
  def show
    @str=''
    @lbd=Leaderboard.find_by_user_id(current_user.id)
    @loc='/bollywoods/'+(Integer(params[:id])+1).to_s
    @lbd.curb=Integer(params[:id])
    if Integer(params[:id])==1
      @lbd.Bscore=0
    end
    @lbd.bollycheck = true
    @lbd.save
    if @bollywood
      if(params[:A])
        @str=@str+'A'
      end
      if(params[:B])
        @str=@str+'B'
      end
      if(params[:C])
        @str=@str+'C'
      end
      if(params[:D])
        @str=@str+'D'
      end
      if(@bollywood.MultiChoice == false)
        @str=params[:ans]
      end
      if(@str==@bollywood.correctans)
        @lbd.Bscore+=10
        @lbd.maxb=@lbd.maxb > @lbd.Bscore ? @lbd.maxb : @lbd.Bscore
        if @lbd.maxb > Bollywood.count()*10

SELECT  `bollywoods`.* FROM `bollywoods` WHERE `bollywoods`.`id` = 1 LIMIT 1
---
    def set_bollywood
      # @lbd=Leaderboard.find_by_user_id(current_user.id)
      if Integer(params[:id])<=Bollywood.count
        @bollywood = Bollywood.find(params[:id])