app/controllers/crickets_controller.rb

SELECT `crickets`.* FROM `crickets`
SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 1 LIMIT 1
SELECT `leaderboards`.* FROM `leaderboards` ORDER BY maxb DESC
SELECT COUNT(*) FROM `crickets`
SELECT COUNT(*) FROM `leaderboards`
UPDATE `leaderboards` SET `curc` = 0, `Cscore` = 0, `updated_at` = '2017-09-17 14:23:13' WHERE `leaderboards`.`id` = 1
---
  def index
    if not current_user
      redirect_to '/users/sign_in'
    else
      @crickets = Cricket.all
      @lbd=Leaderboard.find_by_user_id(current_user.id)
      @lboard=Leaderboard.find_by_user_id(current_user.id)
      @bol=Leaderboard.order('maxb DESC')
      if @lbd.curc==Cricket.count
        @lbd.Cscore=0
        @lbd.curc=0
        @lbd.save

SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 1 LIMIT 1
UPDATE `leaderboards` SET `Cscore` = 50, `updated_at` = '2017-09-17 14:46:01', `maxc` = 50, `maxb` = 40 WHERE `leaderboards`.`id` = 1
SELECT COUNT(*) FROM `crickets`
---
  def show
    @str=''
    @lbd=Leaderboard.find_by_user_id(current_user.id)
    @loc='/crickets/'+(Integer(params[:id])+1).to_s
    @lbd.curc=Integer(params[:id])
    if Integer(params[:id])==1
      @lbd.Cscore=0
    end
    @lbd.crikcheck = true
    @lbd.save
    if @cricket
      if(params[:A])
        @str=@str+'A'
      end
      if(params[:B])
        @str=@str+'B'
      end
      if(params[:C])
        @str=@str+'C'
      end
      if(params[:D])
        @str=@str+'D'
      end
      if @cricket.MultiChoice==false
        @str=params[:ans]
      end
      if(@str==@cricket.correctans)
        @lbd.Cscore+=10
        @lbd.maxc=@lbd.maxc > @lbd.Cscore ? @lbd.maxc : @lbd.Cscore
        if @lbd.maxc > (Cricket.count)*10

SELECT  `crickets`.* FROM `crickets` WHERE `crickets`.`id` = 1 LIMIT 1
---
    def set_cricket
      if Integer(params[:id])<=Cricket.count
        @cricket = Cricket.find(params[:id])