app/controllers/footballs_controller.rb

SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 1 LIMIT 1
SELECT `leaderboards`.* FROM `leaderboards` ORDER BY maxb DESC
SELECT COUNT(*) FROM `footballs`
SELECT COUNT(*) FROM `leaderboards`
UPDATE `leaderboards` SET `curf` = 0, `Fscore` = 0, `updated_at` = '2017-09-17 14:25:21' WHERE `leaderboards`.`id` = 1
---
  def index
    if current_user
      @footballs = Football.all
      @lbd=Leaderboard.find_by_user_id(current_user.id)
      @lboard=Leaderboard.find_by_user_id(current_user.id)
      @bol=Leaderboard.order('maxb DESC')
      if @lbd.curf==Football.count()
        @lbd.Fscore=0
        @lbd.curf=0
        @lbd.save

SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 1 LIMIT 1
UPDATE `leaderboards` SET `curf` = 1, `footcheck` = 1, `updated_at` = '2017-09-19 23:04:43' WHERE `leaderboards`.`id` = 1
SELECT COUNT(*) FROM `footballs`
---
  def show
    @str=''
    @lbd=Leaderboard.find_by_user_id(current_user.id)
    @loc='/footballs/'+(Integer(params[:id])+1).to_s
    @lbd.curf=Integer(params[:id])
    if Integer(params[:id])==1
      @lbd.Fscore=0
    end
    @lbd.footcheck = true
    @lbd.save
    if @football
      if(params[:A])
        @str=@str+'A'
      end
      if(params[:B])
        @str=@str+'B'
      end
      if(params[:C])
        @str=@str+'C'
      end
      if(params[:D])
        @str=@str+'D'
      end
      if(@football.MultiChoice == false)
        @str=params[:ans]
      end
      if(@str==@football.correctans)
        @lbd.Fscore+=10
        @lbd.maxf=@lbd.maxf > @lbd.Fscore ? @lbd.maxf : @lbd.Fscore
        if @lbd.maxf > Football.count()*10

SELECT  `footballs`.* FROM `footballs` WHERE `footballs`.`id` = 1 LIMIT 1
---
    def set_football
      if Integer(params[:id])<=Football.count
        @football = Football.find(params[:id])