app/controllers/hollywoods_controller.rb

  def index
    if current_user
      @hollywoods = Hollywood.all
      @lbd=Leaderboard.find_by_user_id(current_user.id)
      @lboard=Leaderboard.find_by_user_id(current_user.id)
      @bol=Leaderboard.order('maxb DESC')
      if @lbd.curh==Hollywood.count()
        @lbd.Hscore=0
        @lbd.curh=0
        @lbd.save
---
SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 1 LIMIT 1
SELECT `leaderboards`.* FROM `leaderboards` ORDER BY maxb DESC
SELECT COUNT(*) FROM `hollywoods`
SELECT COUNT(*) FROM `leaderboards`
UPDATE `leaderboards` SET `curh` = 0, `Hscore` = 0, `updated_at` = '2017-09-17 14:28:44' WHERE `leaderboards`.`id` = 1

  def show
    @str=''
    @lbd=Leaderboard.find_by_user_id(current_user.id)
    @loc='/hollywoods/'+(Integer(params[:id])+1).to_s
    @lbd.curh=Integer(params[:id])
    if Integer(params[:id])==1
      @lbd.Hscore=0
    end
    @lbd.hollycheck = true
    @lbd.save
    if @hollywood
      if(params[:A])
        @str=@str+'A'
      end
      if(params[:B])
        @str=@str+'B'
      end
      if(params[:C])
        @str=@str+'C'
      end
      if(params[:D])
        @str=@str+'D'
      end
      if @hollywood.MultiChoice==false
        @str=params[:ans]
      end
      if(@str==@hollywood.correctans)
        @lbd.Hscore+=10
        @lbd.maxh=@lbd.maxh > @lbd.Fscore ? @lbd.maxf : @lbd.Fscore
        if @lbd.maxh > Hollywood.count()*10
---
SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 1 LIMIT 1
UPDATE `leaderboards` SET `curh` = 1, `hollycheck` = 1, `updated_at` = '2017-09-19 22:27:26' WHERE `leaderboards`.`id` = 1
SELECT COUNT(*) FROM `hollywoods`

    def set_hollywood
      if Integer(params[:id])<=Hollywood.count
        @hollywood = Hollywood.find(params[:id])
---
SELECT  `hollywoods`.* FROM `hollywoods` WHERE `hollywoods`.`id` = 1 LIMIT 1