app/controllers/users/registrations_controller.rb

  def create
    super
    if current_user
      Leaderboard.create(user_id: current_user.id)
---
INSERT INTO `leaderboards` (`user_id`, `created_at`, `updated_at`) VALUES (3, '2017-09-16 12:16:25', '2017-09-16 12:16:25')
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('b@b.com', '$2a$11$IaVmPeIbA88qXbTa1HP0puw0A1TRjU8l2OZuLmyoL2ifXzh81viOy', '2017-09-16 12:16:25', '2017-09-16 12:16:25')